Revit 2027 API
ExternalServices.BuiltInExternalServices.ExternalDataManagerService Property
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ExternalDataManagerService { get; }
Public Shared ReadOnly Property ExternalDataManagerService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ExternalDataManagerService {
	ExternalServiceId^ get ();
}
static member ExternalDataManagerService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace